Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetAllObjects Method
 Gets all the objects and their children objects in the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetAllObjects()
Public Function GetAllObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
All the objects in the view.
See Also
Reference
ViewBase Class
GetAllObjects Overload
Tekla.Structures.Drawing Namespace